const questionsWithVariants = [
    [{
      title: 'На сайте к элементу текста было применено CSS-свойство transform: rotate(525deg);. Определите, на какой угол в радианах (по отношению к 2π) на самом деле повернулся текст в пределах одного полного оборота?',
      variants: ['\\frac{5\\pi}{12}', '\\frac{11\\pi}{12}', '\\frac{5\\pi}{6}'],
      correct: 1,
    },
    {
      title: 'Геймдев-разработчик настраивает анимацию движения платформы по формуле y = 2sin(x) + 1. Определите все значения x (в радианах), при которых платформа пересечет линию y = 0',
      variants: ['x = (-1)^k\\frac{\\pi}{3} + 2\\pi k, \\quad k \\in \\mathbb{Z}', 'x = (-1)^{k+1}\\frac{2\\pi}{3} + 2\\pi k, \\quad k \\in \\mathbb{Z}', 'x = (-1)^{k+1}\\frac{\\pi}{3} + \\pi k, \\quad k \\in \\mathbb{Z}'],
      correct: 2,
    },
    {
      title: 'Фронтенд-разработчику необходимо анимировать БОЛЕЕ плавные (растянутые по горизонтали, длинные) волны с вертикальным смещением вверх. Какую модификацию функции y = sin(x) ему следует использовать?',
      variants: ['y = sin(3x) - 5', 'y = sin(0.2x + \\frac{\\pi}{3})', 'y = sin(0.5x) + 2'],
      correct: 2,
    },
    {
      title: 'Программист создает собственный генератор псевдослучайных чисел на основе тригонометрии. По техзаданию функция должна возвращать значения y строго в диапазоне [-5; 1]. Текущая формула y = cos(x + π∕3) - 9 выдает ошибку ValueOutOfBoundsException, так как выходит за эти рамки. Модернизируйте формулу, чтобы её область значений идеально совпала с требуемым диапазоном [-5; 1]',
      variants: ['y = -3cos(x) + 3', 'y = сos(-3x + \\frac{\\pi}{3}) - 2', 'y = 3cos(x + \\frac{\\pi}{3}) - 2'],
      correct: 2,
    },
    {
    title: 'Фронтенд-разработчику нужна анимация движения по верхней полуокружности в диапазоне (0; π). Какая из тригонометрических функций имеет такую область значений?',
    variants: ['y = arcsin(x)', 'y = arcctg(x)', 'y = arctg(x)'],
    correct: 1,
    },
    {
      title: 'Геймдев-разработчик настраивает логику круглых часов в игре. Ему нужно повесить триггер на часовую (меньшую) стрелку. В момент времени 6:30 стрелка должна активировать событие. Определите угол поворота часовой стрелки в тригонометрической системе координат (где 0° — это направление на 3 часа, а отсчет идет против часовой стрелки)',
      variants: ['255°', '-115°', '270°'],
      correct: 0,
    },
    {
      title: 'Геймдев-разработчик настраивает скорость движения камеры. Исходная формула y = tg(x) на промежутке (-π∕2; π∕2) работает некорректно, совершая слишком резкий рывок. Как ему модернизировать формулу, чтобы снизить общую скорость и заставить камеру дольше оставаться в зоне низких значений?',
      variants: ['y = tg(x) - 2', 'y = 0.1tg(x)', 'y = 3tg(x)'],
      correct: 1,
    },
    {
      title: 'При разработке графического движка программист столкнулся с тем, что используемая внешняя библиотека выполняет все тригонометрические расчеты исключительно в радианах, а интерфейс приложения должен отображать углы в привычной пользователю градусной мере. Встроенного конвертера в библиотеке нет. Переведите в градусы значение 3.5рад, полученное от движка',
      variants: ['199.5°', '192.5°', '210°'],
      correct: 0,
    },
    {
      title: 'Разработчику понадобилось математическое API, в котором доступны только функции tg(α) и ctg(α). Для работы приложения необходимо вычислить cos(α). По какой из формул можно выразить косинус через имеющиеся функции?',
      variants: ['ctg^2(α) + 1 = \\frac{1}{cos^2(α)}', 'tg^2(α) = \\frac{1}{cos^2(α)}', 'tg^2(α) + 1 = \\frac{1}{cos^2(α)}'],
      correct: 2,
    },
    {
      title: 'Разработчик обнаружил в старом модуле анимации избыточное выражение: y = (-4sin²(2α)cos²(2α)) + cos²(4α). Оптимизируйте формулу тригонометрическими тождествами, чтобы снизить нагрузку на процессор',
      variants: ['cos(8α)', '2cos(8α)', '2cos(4α)'],
      correct: 0,
    }],
    [{
      title: 'Геймдев-разработчик настраивает логику круглых часов в игре. Ему нужно повесить триггер на минутную стрелку. В момент времени 57 минут 30 секунд стрелка должна активировать событие. Определите угол поворота минутной стрелки в тригонометрической системе координат (где 0° — это направление на 3 часа, а отсчет идет против часовой стрелки)',
      variants: ['115°', '-255°', '120°'],
      correct: 1,
    },
    {
      title: 'При разработке графического движка программист столкнулся с тем, что используемая внешняя библиотека выполняет все тригонометрические расчеты исключительно в радианах, а интерфейс приложения должен отображать углы в привычной пользователю градусной мере. Встроенного конвертера в библиотеке нет. Переведите в градусы значение 2.5рад, полученное от движка',
      variants: ['140°', '142.5°', '137.5°'],
      correct: 1,
    },
    {
      title: 'Разработчику понадобилось математическое API, в котором доступны только функции tg(α) и ctg(α). Для работы приложения необходимо вычислить sin(α). По какой из формул можно выразить синус через имеющиеся функции?',
      variants: ['ctg^2(α) + 1 = \\frac{1}{sin^2(α)}', 'tg^2(α) = \\frac{1}{sin^2(α)}', 'tg^2(α) + 1 = \\frac{1}{sin^2(α)}'],
      correct: 0,
    },
    {
      title: 'На сайте к элементу текста было применено CSS-свойство transform: rotate(-740deg);. Определите, на какой угол в радианах (по отношению к 2π) на самом деле повернулся текст в пределах одного полного оборота?',
      variants: ['\\frac{-1\\pi}{9}', '\\frac{5\\pi}{6}', '\\frac{-17\\pi}{9}'],
      correct: 0,
    },
    {
      title: 'Разработчик обнаружил в старом модуле анимации избыточное выражение: y = 4(2cos²(α) - 1)sin(2α). Оптимизируйте формулу тригонометрическими тождествами, чтобы снизить нагрузку на процессор',
      variants: ['4sin(4α)', '2sin(2α)', '2sin(4α)'],
      correct: 2,
    },
    {
      title: 'Фронтенд-разработчику нужна анимация движения по правой полуокружности в диапазоне (-π∕2; π∕2). Какая из тригонометрических функций имеет такую область значений?',
      variants: ['y = arctg(x)', 'y = arccos(x)', 'y = arcctg(x)'],
      correct: 0,
    },
    {
      title: 'Программист создает собственный генератор псевдослучайных чисел на основе тригонометрии. По техзаданию функция должна возвращать значения y строго в диапазоне [2; 6]. Текущая формула y = sin(x + π∕3) - 6 выдает ошибку ValueOutOfBoundsException, так как выходит за эти рамки. Модернизируйте формулу, чтобы её область значений идеально совпала с требуемым диапазоном [2; 6]',
      variants: ['y = sin(x) + 6', 'y = sin(2x + \\frac{\\pi}{3}) - 4', 'y = -2sin(x) + 4'],
      correct: 2,
    },
    {
      title: 'Геймдев-разработчик настраивает скорость движения камеры. Исходная формула y = ctg(x) на промежутке (0; π) работает некорректно, совершая слишком вялый рывок. Как ему модернизировать формулу, чтобы увеличить общую скорость в каждой точке графика?',
      variants: ['y = 0.3ctg(x)', 'y = 2ctg(x)', 'y = ctg(x) + 1'],
      correct: 1,
    },
    {
      title: 'Геймдев-разработчик настраивает анимацию движения платформы по формуле y = 2cos(x) + 1. Определите все значения x (в радианах), при которых платформа пересечет линию y = 0',
      variants: ['x = \\pm\\frac{\\pi}{3} + 2\\pi k, \\quad k \\in \\mathbb{Z}', 'x = \\pm\\frac{2\\pi}{3} + \\pi k, \\quad k \\in \\mathbb{Z}', 'x = \\pm\\frac{2\\pi}{3} + 2\\pi k, \\quad k \\in \\mathbb{Z}'],
      correct: 2,
    },
    {
      title: 'Фронтенд-разработчику необходимо анимировать БОЛЕЕ резкие (большие по высоте) волны с горизонтальным смещением влево. Какую модификацию функции y = sin(x) ему следует использовать?',
      variants: ['y = 0.2sin(x) + 5', 'y = 4sin(x + 3)', 'y = sin(0.5x + 3)'],
      correct: 1,
    }]
];


export default questionsWithVariants;